Revit 2027 API
ParameterTypeId.HandrailProjectionParam Property
 "Projection"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId HandrailProjectionParam { get; }
Public Shared ReadOnly Property HandrailProjectionParam As ForgeTypeId
	Get
public:
static property ForgeTypeId^ HandrailProjectionParam {
	ForgeTypeId^ get ();
}
static member HandrailProjectionParam : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace